issues/9.tex
% Created 2024-07-04 Thu 16:37
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\author{Grolter Bell}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Grolter Bell},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}


\section{Issue 9}
\label{sec:orgcbeb620}
(See also \href{https://github.com/s-expressionists/wscl/issues/63}{WSCL issue 63}.)

It is not clear whether it should be allowed to use \texttt{""} as a local nickname,
and in the case this is allowed, whether it should affect the \texttt{:xxxx} syntax.
\subsection{Example}
\label{sec:orgf25a6d8}
\begin{verbatim}
(defpackage #:foo
  (:use #:cl)
  (:local-nicknames ("" "CL")))

(in-package #:foo)

(print (package-name (symbol-package ':*package*)))
; => "KEYWORD"  (sbcl, ccl, ecl, clasp, abcl, lispworks)
; => "COMMON-LISP"  (acl)

(print (package-name (symbol-package '||:*package*)))
; => "KEYWORD"  (ecl, clasp, lispworks)
; => "COMMON-LISP"  (sbcl, ccl, acl)
; abcl errors
\end{verbatim}
\subsection{Currently}
\label{sec:orgd2884e5}
sbcl, ccl:
\texttt{:xxxx} is read as a keyword;
\texttt{||:xxxx} is read as a symbol in the package named or nicknamed \texttt{""}.

acl:
\texttt{:xxxx} and \texttt{||:xxxx} are read as a symbol in the package named or nicknamed \texttt{""}.
\texttt{""} is by default a global nickname for the \texttt{\#:KEYWORD} package.

ecl, clasp, lispworks:
\texttt{||:xxxx} and \texttt{:xxxx} are read as a keyword.

abcl:
\texttt{:xxxx} is read as a keyword;
\texttt{||:xxxx} syntax cannot be read (attemts result in an error).
\subsection{Proposals}
\label{sec:orgcf94c06}
\begin{itemize}
\item The \texttt{""} local nickname should be explicitely allowed.
\texttt{:xxxx} should be always read as a keyword;
\texttt{||:xxxx} should be read as a symbol in the package named or nicknamed by \texttt{""}.
\item The \texttt{""} local nickname should be explicitely allowed.
Both \texttt{:xxxx} and \texttt{||:xxxx} should be read as a symbol in the package
named or nicknamed by \texttt{""}.
\end{itemize}
\end{document}